Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 32, 32, 3)]  0                                            
__________________________________________________________________________________________________
conv2d_noise (conv2d_noise)     (None, 32, 32, 12)   336         input_1[0][0]                    
__________________________________________________________________________________________________
batch_normalization (BatchNorma (None, 32, 32, 12)   48          conv2d_noise[0][0]               
__________________________________________________________________________________________________
activation_quant (activation_qu (None, 32, 32, 12)   1           batch_normalization[0][0]        
__________________________________________________________________________________________________
conv2d_noise_1 (conv2d_noise)   (None, 32, 32, 12)   1308        activation_quant[0][0]           
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 32, 32, 12)   48          conv2d_noise_1[0][0]             
__________________________________________________________________________________________________
activation_quant_1 (activation_ (None, 32, 32, 12)   1           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
conv2d_noise_2 (conv2d_noise)   (None, 32, 32, 12)   1308        activation_quant_1[0][0]         
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 32, 32, 12)   48          conv2d_noise_2[0][0]             
__________________________________________________________________________________________________
add (Add)                       (None, 32, 32, 12)   0           activation_quant[0][0]           
                                                                 batch_normalization_2[0][0]      
__________________________________________________________________________________________________
activation_quant_2 (activation_ (None, 32, 32, 12)   1           add[0][0]                        
__________________________________________________________________________________________________
conv2d_noise_3 (conv2d_noise)   (None, 32, 32, 12)   1308        activation_quant_2[0][0]         
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 32, 32, 12)   48          conv2d_noise_3[0][0]             
__________________________________________________________________________________________________
activation_quant_3 (activation_ (None, 32, 32, 12)   1           batch_normalization_3[0][0]      
__________________________________________________________________________________________________
conv2d_noise_4 (conv2d_noise)   (None, 32, 32, 12)   1308        activation_quant_3[0][0]         
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 32, 32, 12)   48          conv2d_noise_4[0][0]             
__________________________________________________________________________________________________
add_1 (Add)                     (None, 32, 32, 12)   0           activation_quant_2[0][0]         
                                                                 batch_normalization_4[0][0]      
__________________________________________________________________________________________________
activation_quant_4 (activation_ (None, 32, 32, 12)   1           add_1[0][0]                      
__________________________________________________________________________________________________
conv2d_noise_5 (conv2d_noise)   (None, 32, 32, 12)   1308        activation_quant_4[0][0]         
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 32, 32, 12)   48          conv2d_noise_5[0][0]             
__________________________________________________________________________________________________
activation_quant_5 (activation_ (None, 32, 32, 12)   1           batch_normalization_5[0][0]      
__________________________________________________________________________________________________
conv2d_noise_6 (conv2d_noise)   (None, 32, 32, 12)   1308        activation_quant_5[0][0]         
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, 32, 32, 12)   48          conv2d_noise_6[0][0]             
__________________________________________________________________________________________________
add_2 (Add)                     (None, 32, 32, 12)   0           activation_quant_4[0][0]         
                                                                 batch_normalization_6[0][0]      
__________________________________________________________________________________________________
activation_quant_6 (activation_ (None, 32, 32, 12)   1           add_2[0][0]                      
__________________________________________________________________________________________________
conv2d_noise_7 (conv2d_noise)   (None, 16, 16, 24)   2616        activation_quant_6[0][0]         
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, 16, 16, 24)   96          conv2d_noise_7[0][0]             
__________________________________________________________________________________________________
activation_quant_7 (activation_ (None, 16, 16, 24)   1           batch_normalization_7[0][0]      
__________________________________________________________________________________________________
conv2d_noise_8 (conv2d_noise)   (None, 16, 16, 24)   5208        activation_quant_7[0][0]         
__________________________________________________________________________________________________
conv2d_noise_9 (conv2d_noise)   (None, 16, 16, 24)   312         activation_quant_6[0][0]         
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, 16, 16, 24)   96          conv2d_noise_8[0][0]             
__________________________________________________________________________________________________
add_3 (Add)                     (None, 16, 16, 24)   0           conv2d_noise_9[0][0]             
                                                                 batch_normalization_8[0][0]      
__________________________________________________________________________________________________
activation_quant_8 (activation_ (None, 16, 16, 24)   1           add_3[0][0]                      
__________________________________________________________________________________________________
conv2d_noise_10 (conv2d_noise)  (None, 16, 16, 24)   5208        activation_quant_8[0][0]         
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, 16, 16, 24)   96          conv2d_noise_10[0][0]            
__________________________________________________________________________________________________
activation_quant_9 (activation_ (None, 16, 16, 24)   1           batch_normalization_9[0][0]      
__________________________________________________________________________________________________
conv2d_noise_11 (conv2d_noise)  (None, 16, 16, 24)   5208        activation_quant_9[0][0]         
__________________________________________________________________________________________________
batch_normalization_10 (BatchNo (None, 16, 16, 24)   96          conv2d_noise_11[0][0]            
__________________________________________________________________________________________________
add_4 (Add)                     (None, 16, 16, 24)   0           activation_quant_8[0][0]         
                                                                 batch_normalization_10[0][0]     
__________________________________________________________________________________________________
activation_quant_10 (activation (None, 16, 16, 24)   1           add_4[0][0]                      
__________________________________________________________________________________________________
conv2d_noise_12 (conv2d_noise)  (None, 16, 16, 24)   5208        activation_quant_10[0][0]        
__________________________________________________________________________________________________
batch_normalization_11 (BatchNo (None, 16, 16, 24)   96          conv2d_noise_12[0][0]            
__________________________________________________________________________________________________
activation_quant_11 (activation (None, 16, 16, 24)   1           batch_normalization_11[0][0]     
__________________________________________________________________________________________________
conv2d_noise_13 (conv2d_noise)  (None, 16, 16, 24)   5208        activation_quant_11[0][0]        
__________________________________________________________________________________________________
batch_normalization_12 (BatchNo (None, 16, 16, 24)   96          conv2d_noise_13[0][0]            
__________________________________________________________________________________________________
add_5 (Add)                     (None, 16, 16, 24)   0           activation_quant_10[0][0]        
                                                                 batch_normalization_12[0][0]     
__________________________________________________________________________________________________
activation_quant_12 (activation (None, 16, 16, 24)   1           add_5[0][0]                      
__________________________________________________________________________________________________
conv2d_noise_14 (conv2d_noise)  (None, 8, 8, 48)     10416       activation_quant_12[0][0]        
__________________________________________________________________________________________________
batch_normalization_13 (BatchNo (None, 8, 8, 48)     192         conv2d_noise_14[0][0]            
__________________________________________________________________________________________________
activation_quant_13 (activation (None, 8, 8, 48)     1           batch_normalization_13[0][0]     
__________________________________________________________________________________________________
conv2d_noise_15 (conv2d_noise)  (None, 8, 8, 48)     20784       activation_quant_13[0][0]        
__________________________________________________________________________________________________
conv2d_noise_16 (conv2d_noise)  (None, 8, 8, 48)     1200        activation_quant_12[0][0]        
__________________________________________________________________________________________________
batch_normalization_14 (BatchNo (None, 8, 8, 48)     192         conv2d_noise_15[0][0]            
__________________________________________________________________________________________________
add_6 (Add)                     (None, 8, 8, 48)     0           conv2d_noise_16[0][0]            
                                                                 batch_normalization_14[0][0]     
__________________________________________________________________________________________________
activation_quant_14 (activation (None, 8, 8, 48)     1           add_6[0][0]                      
__________________________________________________________________________________________________
conv2d_noise_17 (conv2d_noise)  (None, 8, 8, 48)     20784       activation_quant_14[0][0]        
__________________________________________________________________________________________________
batch_normalization_15 (BatchNo (None, 8, 8, 48)     192         conv2d_noise_17[0][0]            
__________________________________________________________________________________________________
activation_quant_15 (activation (None, 8, 8, 48)     1           batch_normalization_15[0][0]     
__________________________________________________________________________________________________
conv2d_noise_18 (conv2d_noise)  (None, 8, 8, 48)     20784       activation_quant_15[0][0]        
__________________________________________________________________________________________________
batch_normalization_16 (BatchNo (None, 8, 8, 48)     192         conv2d_noise_18[0][0]            
__________________________________________________________________________________________________
add_7 (Add)                     (None, 8, 8, 48)     0           activation_quant_14[0][0]        
                                                                 batch_normalization_16[0][0]     
__________________________________________________________________________________________________
activation_quant_16 (activation (None, 8, 8, 48)     1           add_7[0][0]                      
__________________________________________________________________________________________________
conv2d_noise_19 (conv2d_noise)  (None, 8, 8, 48)     20784       activation_quant_16[0][0]        
__________________________________________________________________________________________________
batch_normalization_17 (BatchNo (None, 8, 8, 48)     192         conv2d_noise_19[0][0]            
__________________________________________________________________________________________________
activation_quant_17 (activation (None, 8, 8, 48)     1           batch_normalization_17[0][0]     
__________________________________________________________________________________________________
conv2d_noise_20 (conv2d_noise)  (None, 8, 8, 48)     20784       activation_quant_17[0][0]        
__________________________________________________________________________________________________
batch_normalization_18 (BatchNo (None, 8, 8, 48)     192         conv2d_noise_20[0][0]            
__________________________________________________________________________________________________
add_8 (Add)                     (None, 8, 8, 48)     0           activation_quant_16[0][0]        
                                                                 batch_normalization_18[0][0]     
__________________________________________________________________________________________________
activation_quant_18 (activation (None, 8, 8, 48)     1           add_8[0][0]                      
__________________________________________________________________________________________________
average_pooling2d (AveragePooli (None, 1, 1, 48)     0           activation_quant_18[0][0]        
__________________________________________________________________________________________________
flatten (Flatten)               (None, 48)           0           average_pooling2d[0][0]          
__________________________________________________________________________________________________
dense_noise (dense_noise)       (None, 10)           490         flatten[0][0]                    
==================================================================================================
Total params: 155,261
Trainable params: 154,229
Non-trainable params: 1,032
__________________________________________________________________________________________________
ResNet20v1_act3b_wnoise0.20